# StairGetTotalRiseM

## Description
Returns Total Rise

```pascal
FUNCTION StairGetTotalRiseM(stair : HANDLE) : REAL;
```

```python

def vs.StairGetTotalRiseM(stair):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs